import { useState, useEffect  } from "react";

export default function AboutClinic() {
    useEffect(() => {
      document.title = "Про клініку – Numa.Dental";
    }, []);

  return (
    <section className="w-full py-20 font-quicksand text-[#333333]">
      {/* breadcrumb */}
      <div className="max-w-[1240px] ml-10 xl:mx-auto mb-5 lg:ml-20 lg:mb-10 lg:mt-6 ">
        <p className="lg:text-[14px] text-[12px] text-[#555555] tracking-wide">
          <a href="/" className="text-[#555555] hover:opacity-70 tracking-[0.1em]">
            ГОЛОВНА
          </a>
          <span className="text-[#404040] font-semibold"> / ПРО КЛІНІКУ</span>
        </p>

        <h1 className="text-[40px] mt-2 xl:text-[60px] lg:text-[40px] font-bold text-[#404040] leading-none mt-4">
          ПРО КЛІНІКУ<span className="text-[#404040]">.</span>
        </h1> 
      </div>
      <div className="max-w-[1240px] lg:mx-auto space-y-1 mx-5 px-5 xl:ml-50 lg:ml-33 xl:mr-130 lg:mr-30 xl:text-[17px] lg:text-[15px]">
        <p>
          У  <span className="font-bold">Numa.Dental</span> ми поєднуємо сучасні стоматологічні методи та інноваційні технології з турботою про ваш комфорт і безпеку. 
          Тут науково обґрунтований підхід дозволяє досягати здорової, функціональної та естетичної усмішки, якій можна довіряти.
        </p><br></br>
        <p className="font-bold">Переваги Numa Dental Clinic</p>
        <p>• 💎 Повний цикл послуг в одному місці (від КТ до лабораторії)<br></br>
• 🧠 Команда кваліфікованих спеціалістів<br></br>
• 🕓 Зручний графік — 7 днів на тиждень<br></br>
• 💰 Оптимальні ціни без “преміальних” націнок<br></br>
• 🦷 Висока якість та сучасні технології (мікроскоп, 3D-сканер)<br></br>
• 📍 Зручна локація — центр, метро, офісні будівлі навколо<br></br>
• ❤️ Дружній, відкритий сервіс без показного люксу</p><br></br>
        <p className="font-bold">Місія та філософія</p>
        <p>Місія Numa Dental Clinic — зробити якісну стоматологію в Києві доступною та природною частиною життя людей.
Не елітарна медицина “для обраних”, а чесне, технологічне та турботливе лікування, до якого хочеться повертатися.</p><br></br>
        <p className="font-bold">Головні принципи:</p>
        <p>• Чесність і прозорість;<br></br>
• Сучасні технології;<br></br>
• Командний підхід;<br></br>
• Турбота про пацієнта, а не про чек.</p>
      </div>
    </section>
  )
}